controllers/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "some comment"], ["user_id", 2], ["post_id", 1], ["created_at", "2022-02-06 21:38:42.240713"], ["updated_at", "2022-02-06 21:38:42.240713"]]
---
  def create
    comment = Comment.create!(comment_params)