controllers/app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "category", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "some new post5"], ["category", nil], ["user_id", 1], ["created_at", "2022-02-07 08:59:15.419231"], ["updated_at", "2022-02-07 08:59:15.419231"]]
---
  def create
    post = Post.create!(post_params)

UPDATE "posts" SET "category" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["category", "SOme category"], ["updated_at", "2022-02-06 20:34:02.417405"], ["id", 1]]
---
  def update
    @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
---
  def delete
    @post.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."user_id" != ?  [["user_id", 1], ["user_id", 2]]
---
  def get_by
    posts = Post.where(filter_params).where.not(user_id: params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" != ? ORDER BY "posts"."created_at" DESC  [["user_id", 1]]
---
  def ordered_by_date
    render json: Post.order(created_at: :desc).where.not(user_id: params[:user_id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def check_user
    @post = Post.find(params[:id])
    @user = User.find(params[:user_id])