controllers/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "some name"], ["created_at", "2022-02-06 20:06:58.009962"], ["updated_at", "2022-02-06 20:06:58.009962"]]
---
  def create
    user = User.create(name: params[:name])